InformationRegisters/КэшОписанияОстатковИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>КэшОписанияОстатковИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозрастнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВозрастныеКатегорииИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВводаВОборотСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварныйЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевойПол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦелевойПолИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КэшОписанияОстатковИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьТаблицуПредставленийGTINОстатки(
	ИсходныеДанные,
	Организация = Неопределено,
	ВидПродукции = Неопределено,
	ИмяКолонкиПредставление = "ПредставлениеGTINОстатки") Экспорт
	
	СоответствиеGTIN = Новый Соответствие();
	МассивGTIN       = Новый Массив();
	НачалоGTIN       = ИнтеграцияИСМПСлужебныйКлиентСервер.НачалоGTINМаркировкиОстатков();
	
	Для Каждого СтрокаТаблицы Из ИсходныеДанные Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура)
			Или Не СтрНачинаетсяС(СтрокаТаблицы.GTIN, НачалоGTIN) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы[ИмяКолонкиПредставление] = "";
		
		МассивСтрок = СоответствиеGTIN.Получить(СтрокаТаблицы.GTIN);
		Если МассивСтрок = Неопределено Тогда
			МассивСтрок = Новый Массив();
			СоответствиеGTIN.Вставить(СтрокаТаблицы.GTIN, МассивСтрок);
		КонецЕсли;
		
		МассивСтрок.Добавить(СтрокаТаблицы);
		
		МассивGTIN.Добавить(СтрокаТаблицы.GTIN);
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивGTIN);
	
	Если МассивGTIN.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КэшОписанияОстатковИСМП.GTIN          КАК GTIN,
		|	КэшОписанияОстатковИСМП.ВидПродукции  КАК ВидПродукции,
		|	КэшОписанияОстатковИСМП.Представление КАК " + ИмяКолонкиПредставление + "
		|ИЗ
		|	РегистрСведений.КэшОписанияОстатковИСМП КАК КэшОписанияОстатковИСМП
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &Организация = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ КэшОписанияОстатковИСМП.Организация = &Организация
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &ВидПродукции = НЕОПРЕДЕЛЕНО
		|			ИЛИ КэшОписанияОстатковИСМП.ВидПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ КэшОписанияОстатковИСМП.ВидПродукции = &ВидПродукции
		|	КОНЕЦ
		|	И КэшОписанияОстатковИСМП.GTIN В (&МассивGTIN)";
	
	Запрос.УстановитьПараметр("МассивGTIN",   МассивGTIN);
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("ВидПродукции", ВидПродукции);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивПолейЗаполнения = Новый Массив();
	МассивПолейЗаполнения.Добавить(ИмяКолонкиПредставление);
	
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		МассивПолейЗаполнения.Добавить("ВидПродукции");
	КонецЕсли;
	
	СписокСвойств = СтрСоединить(МассивПолейЗаполнения, ",");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокиТаблицы = СоответствиеGTIN.Получить(ВыборкаДетальныеЗаписи.GTIN);
		
		Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаДетальныеЗаписи, СписокСвойств);
		КонецЦикла;
		
		СоответствиеGTIN.Удалить(ВыборкаДетальныеЗаписи.GTIN);
		
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из СоответствиеGTIN Цикл
		
		СтрокиТаблицы = КлючИЗначение.Значение;
		
		Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			СтрокаТаблицы[ИмяКолонкиПредставление] = ИнтеграцияИСМПКлиентСервер.ПредставлениеGTINОстаткиПоВидуПродукции(
				СтрокаТаблицы[ИмяКолонкиПредставление], ВидПродукции);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СохранитьПредставлениеОписанияОстатков(КешОписанияОстатков) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого КлючИЗначение Из КешОписанияОстатков Цикл
		
		СтрокаКеша     = КлючИЗначение.Значение;
		МенеджерЗаписи = РегистрыСведений.КэшОписанияОстатковИСМП.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаКеша.ДанныеОписания);
		МенеджерЗаписи.Организация   = СтрокаКеша.Организация;
		МенеджерЗаписи.ВидПродукции  = СтрокаКеша.ВидПродукции;
		МенеджерЗаписи.Представление = СтрокаКеша.Представление;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция МассивGTINОписанияОстатков(Организация = Неопределено, ВидПродукции = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КэшОписанияОстатковИСМП.GTIN
		|ИЗ
		|	РегистрСведений.КэшОписанияОстатковИСМП КАК КэшОписанияОстатковИСМП
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &Организация = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ КэшОписанияОстатковИСМП.Организация = &Организация
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &ВидПродукции = НЕОПРЕДЕЛЕНО 
		|				ИЛИ КэшОписанияОстатковИСМП.ВидПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ КэшОписанияОстатковИСМП.ВидПродукции = &ВидПродукции
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("ВидПродукции", ВидПродукции);
	
	МассивЗначений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("GTIN");
	
	Возврат МассивЗначений;
	
КонецФункции

#КонецОбласти

#КонецЕсли
